УчетВУправляющихДляГит1/src/Documents/КВП_ЗакрытиеЛицевогоСчета/КВП_ЗакрытиеЛицевогоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_ЗакрытиеЛицевогоСчета</name>
  <basedOn>Catalog.КВП_ЛицевыеСчета</basedOn>
  <registerRecords>InformationRegister.КВП_ЛицевыеСчета</registerRecords>
  <registerRecords>InformationRegister.КВП_ЗакрепленныеСчетчики</registerRecords>
  <registerRecords>InformationRegister.УПЖКХ_СведенияОЗарегистрированных</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_Начисления</registerRecords>
  <registerRecords>InformationRegister.КВП_УчетКоличестваЖильцовПоЛицевымСчетам</registerRecords>
  <registerRecords>AccumulationRegister.КВП_НачислениеДляОтраженияВРеглУчете</registerRecords>
  <registerRecords>InformationRegister.УПЖКХ_СобственностьНаПомещения</registerRecords>
  <registerRecords>AccumulationRegister.КВП_ВзаиморасчетыПоЛицевымСчетам</registerRecords>
  <registerRecords>InformationRegister.КВП_НазначенныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_ДанныеДляОтраженияНачисленийВРеглУчете</registerRecords>
  <registerRecords>InformationRegister.КВП_НазначенныеЛьготы</registerRecords>
  <registerRecords>InformationRegister.УПЖКХ_СведенияОПроживающих</registerRecords>
  <registerRecords>InformationRegister.УПЖКХ_СобственникиПомещений</registerRecords>
  <registerRecords>InformationRegister.КВП_СведенияОЖильцах</registerRecords>
  <attributes>
    <name>АннулироватьДанныеОСобственности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбнулитьНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/КВП_ЗакрытиеЛицевогоСчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ЛицевойСчет,
	|	Реквизиты.ОбнулитьНачисления,
	|	Реквизиты.Ответственный,
	|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(Реквизиты.Дата, ДЕНЬ), СЕКУНДА, 1) КАК ДатаПереходаВНовоеСостояние
	|ИЗ
	|	Документ.КВП_ЗакрытиеЛицевогоСчета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	// Ключ "ДатаПереходаВНовоеСостояние" имеет следующее значение - это начало дня, следующего за датой документа.
	// Данный ключ необходим для установки новой даты изменения состояния в регистрах сведений, по которым выполняются проводки.
	// Например, для отмены регистрации или отмена проживания жильца и т.д.
	// При закрытии л/с новое состояние считается с начала следующего дня за датой документа.
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,ЛицевойСчет,ОбнулитьНачисления,Ответственный,ДатаПереходаВНовоеСостояние");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти 

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
